In [1]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          324                 57
1        UAS1         Fisika                          601                 89
2        UTS2         Fisika                          346                 55
3        UAS2         Fisika                          748                 53
4        UTS1     Matematika                          413                 88
5        UAS1     Matematika                          231                 45
6        UTS2     Matematika                          453                 56
7        UAS2     Matematika                          405                 62
8        UTS1     Statistika                          770                 42
9        UAS1     Statistika                          740                 78
10       UTS2     Statistika                          789                 87
11       UAS2     Statistika                          285                 63



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [12]:
#code here
data_nilai = df.sort_values('Rata2 Nilai Ujian', ascending=False)
print(data_nilai)

tipe_ujian = data_nilai['Tipe Ujian'].iloc[-1]
mata_pelajaran = data_nilai['Mata Pelajaran'].iloc[-1]
print('yang memiliki rata-rata nilai terkecil adalah Tipe Ujian ', tipe_ujian , ' dan mata pelajaran ', mata_pelajaran)

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
1        UAS1         Fisika                          601                 89
4        UTS1     Matematika                          413                 88
10       UTS2     Statistika                          789                 87
9        UAS1     Statistika                          740                 78
11       UAS2     Statistika                          285                 63
7        UAS2     Matematika                          405                 62
0        UTS1         Fisika                          324                 57
6        UTS2     Matematika                          453                 56
2        UTS2         Fisika                          346                 55
3        UAS2         Fisika                          748                 53
5        UAS1     Matematika                          231                 45
8        UTS1     Statistika                          770                 42
yang memiliki rata-rata nilai terkecil adalah Tipe Ujian  UTS1  dan mata pelajaran  Statistika

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column. Sedangkan
Melting adalah ‘unpivoting’, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [2]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          689                 99
1        UAS1         Fisika                          495                 72
2        UTS2         Fisika                          294                 54
3        UAS2         Fisika                          798                 87
4        UTS1     Matematika                          362                 64
5        UAS1     Matematika                          577                 46
6        UTS2     Matematika                          578                 83
7        UAS2     Matematika                          521                 53
8        UTS1     Statistika                          381                 75
9        UAS1     Statistika                          287                 48
10       UTS2     Statistika                          492                 73
11       UAS2     Statistika                          374                 52

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [12]:
#code here
rata2_belajar = pd.pivot(df, index='Tipe Ujian', columns='Mata Pelajaran', values=['Rata2 Nilai Ujian', 'Rata2 Waktu Belajar (menit)'] , )
rata2_belajar

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          72         46         48
UAS2                          87         53         52
UTS1                          99         64         75
UTS2                          54         83         73

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   495        577        287
UAS2                                   798        521        374
UTS1                                   689        362        381
UTS2                                   294        578        492

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [14]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [36]:
#code here
df = pd.DataFrame(data)
#df
pd.melt(df, id_vars = ['Hari'])

     Hari        variable  value
0   Sabtu  Kebun Binatang    271
1  Minggu  Kebun Binatang    399
2   Sabtu           Dufan    501
3  Minggu           Dufan    700
4   Sabtu          Disney   1000
5  Minggu          Disney   1001
6   Sabtu            Bali    900
7  Minggu            Bali    803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [54]:
#code here
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
#df
#rata2_nilai = df['Rata2 Nilai Ujian']
#df.insert(4, 'Keterangan kelulusan', ['lulus' if rata2_nilai >=70  else 'Minor' for rata2_nilai in df['Rata2 Nilai Ujian']])

df.loc[df['Rata2 Nilai Ujian'] >= 85, 'Keterangan kelulusan'] = 'lulus' 
df.loc[df['Rata2 Nilai Ujian'] < 85, 'Keterangan kelulusan'] = 'remedial'
df.loc[df['Rata2 Nilai Ujian'] <= 70, 'Keterangan kelulusan'] = 'tidak lulus'
df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Keterangan kelulusan
0,UTS1,Fisika,489,51,tidak lulus
1,UAS1,Fisika,313,73,remedial
2,UTS2,Fisika,200,79,remedial
3,UAS2,Fisika,575,60,tidak lulus
4,UTS1,Matematika,438,79,remedial
5,UAS1,Matematika,607,78,remedial
6,UTS2,Matematika,274,81,remedial
7,UAS2,Matematika,304,40,tidak lulus
8,UTS1,Statistika,429,58,tidak lulus
9,UAS1,Statistika,381,95,lulus
10,UTS2,Statistika,355,80,remedial
11,UAS2,Statistika,510,66,tidak lulus

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---